/***************************************/
/* Ｃ言語版 選択ソート
/***************************************/

#include <stdio.h>
#define LENGTH 7

void selection(int *a1) {
    int *a2, *a3;
    int d0, d1, d2;
    d0 = LENGTH - 1; /* d0 は外側のループ回数 ＝ LENGTH - 1 */

    /* LOOP2 */
    while(d0 > 0) {
        a3 = a1;     /* a3 は最小値のデータの場所を表す */
        d2 = *a3;    /* d2 は最小値のデータを表す */
        a2 = a1 + 1; /* 「ポインタ変数 + 1」は「次の要素」の意味 */
        d1 = d0;

        /* LOOP1 */
        while(d1 > 0) {
            fprintf(stderr, "a2 = 0x%p, *a2 = %d\n", a2, *a2);
            if(!((*a2) > d2)) {
                a3 = a2;
                d2 = *a3;
            }
            /* LABEL1 */
            a2 = a2 + 1; /* 「ポインタ変数 + 1」は「次の要素」の意味 */
            d1--;
        }
        /* swap(a1,a3) */
        *a3 = *a1;
        *a1 = d2;
        a1 = a1 + 1;     /* 「ポインタ変数 + 1」は「次の要素」の意味 */
        d0--;
    }
}

main() {
    int DATA[] = {9, 5, 3, 7, 6, 4, 8};
    int *a1;
    /* start */
    a1 = DATA; /* a1 はソートするデータの先頭を指すポインタ変数 */
    selection(a1);
    exit(0);
}